# В программе phone_book (https://github.com/dbradul/python/blob/master/phone_book.py) реализовать следующие функции:
# find_entry_age_phonebook 		# найти все записи с указанным возрастом
# print_phonebook_by_age		# распечатать все записи отсортированные по возрасту
# delete_entry_name_phonebook	# удалить все записи с указанным именем
# print_avr_age				# распечатать средний возраст всех абонентов
# increase_age				# увеличить возраст всем абонентам на заданное пользователем кол-во лет
# <ваша_функция>				# добавить любую функцию, манипулирующую записями (печать, добавление, удаление) в телефонной книге на ваше усмотрение.
# добавить поддержку еще одного поля (например, скайп, адрес, день рождения) и сделайте по нему поиск и печать.
# Т.е. добавить функцию для поиска и обновить существующую функцию печати.
#
# 	При выполнении обратите внимание на обработку ошибок. Например, если при удалении записи с заданным именем нет, то вывести сообщение “Not found!”.
